app/controllers/sessions_controller.rb

	def create
		#complete this method
		user = User.find_by(email: params[:session][:email].downcase, password: params[:session][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "asd@asd.com"], ["password", "123123123"], ["LIMIT", 1]]