app/controllers/users_controller.rb

  def update
    #complete this method
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "asdzxczxc"], ["updated_at", "2019-04-19 17:34:29.711667"], ["id", 9]]